{
  "case_number": "Ö 2661-24",
  "nickname": "”Aktersnurrans överklagande”",
  "summary": "En åklagare är behörig att överklaga en brottmålsdom beträffande ett enskilt anspråk utan att samtidigt överklaga i ansvarsdelen, om den tilltalade har överklagat domen såvitt avser ansvar för det brott som det enskilda anspråket grundas på.",
  "decision_date": "2024-11-20",
  "publication_time": "2025-04-12T07:33:00",
  "case_id": "2cda8cba-1a26-46c7-9a48-83a8289d3789",
  "type": "DOM_ELLER_BESLUT",
  "is_precedent": true,
  "court": "Högsta domstolen",
  "court_code": "HDO",
  "keywords": [
    "Enskilt anspråk",
    "Åklagares behörighet"
  ],
  "legal_areas": [],
  "legal_references": [
    {
      "reference": "22 kap. 2 § rättegångsbalken (1942:740)",
      "sfs_number": "1942:740"
    }
  ],
  "referenced_publications": [
    "”Båtägarens enskilda anspråk” NJA 1994 s. 306",
    "[\"NJA 2008 s. 436\",\"NJA 2008:32\"]"
  ],
  "pdf_documents": [
    {
      "filename": "Ö 2661-24.pdf",
      "file_id": "190/4c/eb/4ceb8c00-33ea-477c-970f-e6e19a4e26af"
    }
  ],
  "case_url": "https://rattspraxis.etjanst.domstol.se/sok/publicering/15f39a76-80d0-4b82-a512-36d764fbea23",
  "correlation_number": "15f39a76-80d0-4b82-a512-36d764fbea23",
  "full_text": "Sök rättspraxis\nTillbaka\nSkriv ut\nOm avgörandet\nDomstol:\nHögsta domstolen\nMålnummer:\nÖ 2661-24\nReferatnummer:\nNJA 2024:58\nNJA 2024 s. 737\nAvgörandedatum:\n2024-11-20\nLagrum\n22 kap. 2 § rättegångsbalken (1942:740)\n1942:740\nHänvisade rättsfall\n”Båtägarens enskilda anspråk” NJA 1994 s. 306\nNJA 2008 s. 436, NJA 2008:32\nNyckelord\nEnskilt anspråk\nÅklagares behörighet\nNJA 2024:58, NJA 2024 s. 737\n”Aktersnurrans överklagande”\nEn åklagare är behörig att överklaga en brottmålsdom beträffande ett enskilt anspråk utan att samtidigt överklaga i ansvarsdelen, om den tilltalade har överklagat domen såvitt avser ansvar för det brott som det enskilda anspråket grundas på.\nReferat\nNorrköpings tingsrätt\nAllmän åklagare väckte åtal vid Norrköpings tingsrätt mot J.S. för penningtvättsbrott enligt 3 § första stycket 1 lagen (2014:307) om straff för penningtvättsbrott. En målsägande, som företräddes av åklagaren, yrkade skadestånd med 150 000 kr jämte ränta.\nJ.S. förnekade gärningen och bestred det enskilda anspråket.\nTingsrätten (ordförande tingsfiskalen Amelie Elmér) dömde J.S. i dom den 2 november 2023 för penningtvättsbrott enligt 3 § första stycket 1 lagen (2014:307) om straff för penningtvättsbrott till fängelse fyra månader och förpliktade henne att betala skadestånd till målsäganden med 127 900 kr jämte ränta.\nGöta hovrätt\nJ.S. överklagade i Göta hovrätt. Hon yrkade att hovrätten skulle frikänna henne och avslå målsägandens yrkande om skadestånd. Hon yrkade i andra hand strafflindring.\nÅklagaren, som bestred J.S:s ändringsyrkanden, överklagade med viss justering av gärningsbeskrivningen tingsrättens dom i skadeståndsdelen och yrkade att hovrätten fullt ut skulle bifalla målsägandens skadeståndstalan.\nSedan hovrätten lyft frågan om åklagarens behörighet att överklaga tingsrättens dom endast i fråga om skadestånd, anförde åklagaren att behörigheten följde av att ansvarsfrågan var föremål för prövning i hovrätten och att det saknade betydelse vem som överklagat domen i fråga om ansvar.\nJ.S. yrkade att åklagarens överklagande skulle avvisas.\nHovrätten (hovrättsråden Ulrik Lönnmyr, referent, och Annica Kullander samt tf. hovrättsassessorn Jonas Mathsson) avvisade åklagarens överklagande i beslut den 11 mars 2024.\nHovrättens skäl för beslutet\nÅklagaren har med hänvisning till Åklagarmyndighetens rättsliga vägledning 2023:3 ansett att behörigheten att överklaga tingsrättens dom i skadeståndsdelen följer av att ansvarsfrågan är uppe till prövning. Enligt vägledningen saknar det därvid betydelse om det är åklagaren eller den dömde som fullföljt talan i ansvarsdelen.\nAv 22 kap. 2 § RB följer att åklagaren är skyldig att i samband med åtalet förbereda och utföra målsägandens talan om enskilt anspråk om det grundas på ett brott som hör under allmänt åtal. Detta gäller under förutsättning att det kan ske utan väsentlig olägenhet och målsägandens anspråk inte är uppenbart obefogat.\nBehörigheten för åklagaren att i högre rätt föra målsägandens talan är beroende av huruvida talan i ansvarsfrågan fullföljts dit. Fullföljer åklagaren talan i ansvarsfrågan kan talan fullföljas även i fråga om målsägandens enskilda anspråk och har den tilltalade fullföljt talan såväl i ansvarsfrågan som beträffande det enskilda anspråket är åklagaren behörig att i högre rätt föra svarandetalan för målsäganden. Åklagaren är däremot inte behörig att fullfölja talan endast beträffande det enskilda anspråket (se NJA II 1943 s. 291).\nAv det som nu sagts följer alltså att åklagaren inte är behörig att överklaga tingsrättens dom endast beträffande målsägandens enskilda anspråk och detta gäller även om den tilltalade har fullföljt talan i ansvarsfrågan. Det kan här anmärkas, i det fallet åklagaren hade haft en sådan behörighet, att målet i hovrätten skulle ha övergått till att behandlas som ett tvistemål om den tilltalade hade lämnat nöjdförklaring eller återkallat sitt överklagande (jfr 51 kap. 30 § RB).\nÅklagaren har överklagat tingsrättens dom endast i fråga om skadestånd. Eftersom behörigheten att föra målsägandens talan är beroende av att åklagaren även överklagar ansvarsfrågan ska åklagarens överklagande avvisas.\nHögsta domstolen\nRiksåklagaren överklagade och yrkade för målsägandens räkning att HD skulle undanröja hovrättens avvisningsbeslut och återförvisa målet till hovrätten för prövning av målsägandens enskilda anspråk i enlighet med åklagarens överklagande dit.\nJ.S. bestred yrkandet.\nMålet avgjordes efter föredragning.\nFöredraganden, justitiesekreteraren Lovisa Kvist, föreslog i betänkande att HD skulle meddela beslut i huvudsaklig överensstämmelse med HD:s beslut.\nHD (justitieråden Anders Eka, Agneta Bäcklund, Petter Asp, Cecilia Renfors, referent, och Margareta Brattström) meddelade den 20 november 2024 följande beslut.\nSkäl\nBakgrund\n1. J.S. åtalades för penningtvättsbrott. I samband med åtalet yrkade målsäganden, Café Aktersnurran AB, skadestånd av J.S. Åklagaren förde bolagets talan. Tingsrätten dömde J.S. i enlighet med åtalet och beslutade att hon skulle betala skadestånd med en del av det yrkade skadeståndsbeloppet.\n2. J.S. överklagade domen beträffande såväl ansvar som skadestånd. Åklagaren överklagade därefter domen för Café Aktersnurrans räkning och yrkade att bolagets skadeståndstalan skulle bifallas fullt ut.\n3. Hovrätten har avvisat överklagandet med hänvisning till att åklagaren inte är behörig att föra målsägandens talan.\n4. Riksåklagaren har gjort gällande att åklagarens behörighet att företräda målsäganden omfattar rätten att överklaga när ansvarsfrågan är föremål för prövning i högre rätt på grund av den tilltalades överklagande.\nFrågan i HD\n5. Frågan i målet är alltså om åklagaren – när enbart den tilltalade har överklagat i ansvarsdelen – är behörig att för målsägandens räkning överklaga domen beträffande det enskilda anspråket.\nHandläggningen av enskilda anspråk\n6. En talan mot den misstänkte eller annan om enskilt anspråk i anledning av brott får föras i samband med åtal för brottet. Om en fortsatt gemensam handläggning skulle medföra väsentliga olägenheter får rätten förordna att talan ska handläggas som ett tvistemål. En handläggning enligt reglerna om tvistemål kan också bli följden av att ett åtal läggs ned eller avvisas. (Se 22 kap. 1, 5 och 6 §§ RB.)\n7. Överklagas en dom enbart avseende det enskilda anspråket behandlas målet i högre rätt som ett tvistemål (se 51 kap. 30 § RB).\n8. Om ett enskilt anspråk grundas på ett brott som hör under allmänt åtal är åklagaren på målsägandens begäran skyldig att förbereda och utföra målsägandens talan i samband med åtalet, om det kan ske utan väsentlig olägenhet och anspråket inte är uppenbart obefogat. Detta gäller också när anspråket har övertagits av någon annan än målsäganden. (Se 22 kap. 2 § första och tredje styckena RB.)\n9. I rättspraxis har 22 kap. 2 § tolkats på det sättet att åklagaren är behörig att föra i princip varje talan mot den tilltalade i anledning av brottet (jfr ”Båtägarens enskilda anspråk” NJA 1994 s. 306 och även NJA 2008 s. 436). De ändamål som ligger bakom paragrafen – framför allt de processekonomiska fördelarna – har ansetts tala starkt för en sådan ordning. Skillnaden i uttryckssätt i 1 § och 2 § (talan i anledning av brott respektive anspråk som grundas på brott) saknar således numera i praktiken betydelse (se Per Olof Ekelöf m.fl., Rättegång II, 9 uppl. s. 213 och Roberth Nordh, Enskilt anspråk, 3 uppl. s. 21 ff.).\n10. Behörigheten för åklagaren att föra målsägandens talan gäller så länge det enskilda anspråket handläggs i samma rättegång som ansvarstalan avseende det brott som anspråket är knutet till. Om det enskilda anspråket avskiljs från åtalet och handläggs som ett tvistemål är åklagaren alltså inte längre behörig att företräda målsäganden. (Se NJA II 1943 s. 295 och Peter Fitger m.fl., Rättegångsbalken, Supplement 61, november 2008, s. 22:17.)\n11. Syftet med regleringen i 22 kap. 1 § är att parterna och domstolen ska besparas tid och kostnader genom att en talan om enskilt anspråk handläggs i samma rättegång som ansvarstalan.\n12. Skyldigheten för åklagaren att föra målsägandens talan har motiverats med att en målsägande ska kunna få sitt skadeståndsanspråk prövat utan att det medför större olägenheter eller kostnader. Regleringen innebär att en målsägande kan få hjälp av åklagaren att föra skadeståndstalan i de fall han eller hon inte har rätt till målsägandebiträde (jfr 3 § andra stycket lagen, 1988:609, om målsägandebiträde).\nÅklagarens behörighet i högre rätt\n13. Åklagarens behörighet och skyldighet att föra målsägandens talan om enskilt anspråk gäller även i högre rätt. En grundläggande förutsättning är dock att ansvarsfrågan avseende det brott som målsägandens talan avser är föremål för prövning där (se p. 10).\n14. Det är därmed klart att åklagaren inte är behörig att företräda en målsägande i högre rätt när en dom endast har överklagats avseende ett enskilt anspråk. I ett sådant fall handläggs målet som ett tvistemål och åklagaren har inte ställning som part. Det är också klart att åklagaren är behörig att föra målsägandens svarandetalan när den tilltalade har överklagat både i ansvarsfrågan och avseende ett till ansvaret knutet enskilt anspråk.\n15. Det är mera oklart vad som gäller i fråga om överklagande för målsägandens räkning när åklagaren inte avser att överklaga i ansvarsdelen men domen har överklagats av den tilltalade i den delen.\n16. Lagtexten i 22 kap. 2 § RB ger inte någon vägledning. I förarbetena uttalas att åklagaren är behörig att företräda målsäganden när den tilltalade har klagat både i ansvars- och skadeståndsdelen. Samtidigt anges att åklagaren inte får överklaga endast beträffande det enskilda anspråket. Några tydliga uttalanden görs dock inte i frågan om åklagarens behörighet att överklaga för målsägandens räkning när enbart den tilltalade har överklagat i ansvarsdelen. (Jfr NJA II 1943 s. 291.)\n17. När den tilltalade har överklagat både rörande ansvar och enskilt anspråk är åklagaren part i överinstansen. Åklagaren är i det fallet behörig att föra målsägandens talan. Det ligger väl i linje med ändamålsskälen bakom bestämmelsen i 22 kap. 2 § (se p. 11) att åklagarens behörighet även omfattar att överklaga för målsägandens räkning när ansvarsfrågan kommer att prövas på grund av den tilltalades överklagande i ansvarsdelen. En motsatt ordning skulle vara förenad med praktiska olägenheter. Bland annat skulle målsäganden då, trots att åklagaren är part i målet i ansvarsdelen, behöva bevaka frågan och själv – eller genom ombud – överklaga domen.\n18. De lagändringar som har gjorts sedan regleringen infördes och den utvidgning av åklagarens behörighet som följer av rättspraxis talar också för en sådan tolkning av bestämmelsen. (Jfr bl.a. prop. 1969:114 s. 44 f., prop. 1987/88:1 s. 15 f. och ”Båtägarens enskilda anspråk”.)\n19. Några bärande skäl som talar mot denna tolkning finns inte. Åklagarens behörighet att företräda målsäganden kommer visserligen att upphöra om den tilltalade avger en nöjdförklaring eller återkallar sitt överklagande eftersom det enskilda anspråket då ska handläggas som ett tvistemål. Att behörigheten upphör gäller emellertid även vid en tillämpning av 22 kap. 5 eller 6 § RB, till exempel när en talan om enskilt anspråk avskiljs från brottmålet för att handläggas som ett tvistemål.\n20. En åklagare är alltså behörig att överklaga en brottmålsdom beträffande ett enskilt anspråk utan att samtidigt överklaga i ansvarsdelen, om den tilltalade har överklagat domen såvitt avser ansvar för det brott som det enskilda anspråket grundas på.\nBedömningen i detta fall\n21. Åklagaren var behörig att för målsägandens räkning överklaga domen avseende det enskilda anspråket. Det var därför inte riktigt att avvisa överklagandet. Avvisningsbeslutet ska undanröjas och målet återförvisas till hovrätten.\nHD:s avgörande\nHD undanröjer hovrättens beslut och återförvisar målet till hovrätten för fortsatt behandling.\n- Visa mindre innehåll\nDom eller beslut\npicture_as_pdf\nÖ 2661-24.pdf\narrow_forward\nÖppnas i en ny flik\nKontakt\nFrågor och svar\nTillgänglighet\nPrenumerera på RSS-flöde"
}