{
  "case_number": "T 3537-23",
  "nickname": "”Tomträtten i Björkhagen II”",
  "summary": "Förutsättningar för uppsägning av ett tomträttsavtal som avser upplåtelse för annat ändamål än bostadsbebyggelse.  ",
  "decision_date": "2024-12-17",
  "publication_time": "2025-04-12T06:51:00",
  "case_id": "82ae35c3-aa2a-40cd-857d-a3e88b774643",
  "type": "DOM_ELLER_BESLUT",
  "is_precedent": true,
  "court": "Högsta domstolen",
  "court_code": "HDO",
  "keywords": [
    "Tomträtt",
    "Uppsägning"
  ],
  "legal_areas": [],
  "legal_references": [
    {
      "reference": "13 kap. 14 § jordabalken (1970:994)",
      "sfs_number": "1970:994"
    }
  ],
  "referenced_publications": [],
  "pdf_documents": [
    {
      "filename": "T 3537-23.pdf",
      "file_id": "190/00/1b/001bd8d4-0dd9-4040-ad73-20d2abc3fce5"
    }
  ],
  "case_url": "https://rattspraxis.etjanst.domstol.se/sok/publicering/045d2433-4b3f-4e67-9e3f-5aef0d2caac0",
  "correlation_number": "045d2433-4b3f-4e67-9e3f-5aef0d2caac0",
  "full_text": "Sök rättspraxis\nTillbaka\nSkriv ut\nOm avgörandet\nDomstol:\nHögsta domstolen\nMålnummer:\nT 3537-23\nReferatnummer:\nNJA 2024:67\nNJA 2024 s. 831\nAvgörandedatum:\n2024-12-17\nLagrum\n13 kap. 14 § jordabalken (1970:994)\n1970:994\nNyckelord\nTomträtt\nUppsägning\nNJA 2024:67, NJA 2024 s. 831\n”Tomträtten i Björkhagen II”\nFörutsättningar för uppsägning av ett tomträttsavtal som avser upplåtelse för annat ändamål än bostadsbebyggelse.\nReferat\nNacka tingsrätt, mark- och miljödomstolen\nGarageföreningen Regnet ekonomisk förening förde talan vid Nacka tingsrätt, mark- och miljödomstolen mot Stockholms kommun på det sätt som framgår av mark- och miljödomstolens dom.\nMark- och miljödomstolen (rådmannen Magnus Hjort, tekniska rådet Monica Haapaniemi, tingsfiskalen Emma Johnsson och den särskilda ledamoten Sören Kågedal) anförde följande i dom den 20 april 2021.\nBakgrund, yrkande m.m.\nFastigheten SR 2 i Björkhagen ägs av Stockholms kommun. Efter en stadsplaneändring antagen i december 1956 är fastigheten planlagd för garageändamål. Av planbeskrivningen framgår att det rådde brist på biluppställningsplatser i trakten och att det inte var möjligt att helt tillgodose detta behov i direkt anslutning till eller omedelbar närhet av radhusen i området. Därför föreslogs möjlighet att anordna en garagelänga på ca 60 meters längd inom kvarteret Regnet, som tidigare var avsett för bostadsbebyggelse men så illa beläget att det ännu inte hade tagits i anspråk för detta. På platsen uppfördes en garagelänga i en våning för 22 bilplatser.\nGenom tomträttskontrakt upplät kommunen den aktuella fastigheten med tomträtt till Garageföreningen Regnet från och med den 1 oktober 1957. Enligt kontraktet fick fastigheten användas för garageändamål. För uppsägning gällde en första tidsperiod om 40 år, räknat från den 1 januari 1958, och därefter tidsperioder om 20 år. Uppsägning skulle ske minst två år före periodens utgång.\nGenom uppsägning daterad den 7 december 2015 sade Stockholms kommun genom dess exploateringsnämnd upp tomträtten till utgången av den innevarande tjugoårsperioden, dvs. till den 1 januari 2018. Som skäl till uppsägningen angavs att kommunen har behov av att använda fastigheten för bostadsändamål istället för den nuvarande garageändamålsanvändningen. Till grund för uppsägningen låg ett tjänsteutlåtande den 19 oktober 2015 och ett beslut av exploateringsnämnden den \n12 november 2015. Uppsägningen delgavs Garageföreningen Regnet den 9 december 2015.\nGarageföreningen har i detta mål klandrat uppsägningen av tomträtten och yrkat att den ska förklaras ogiltig. Som grund för yrkandet har åberopats att det saknas tillräckliga skäl för uppsägning.\nStockholms kommun har bestritt yrkandet. Som grund för bestridandet har åberopats att det finns tillräckliga skäl för uppsägning.\nGarageföreningen har även framställt formella invändningar mot uppsägningen. Dessa invändningar har prövats vid allmän domstol (HD:s dom den 22 mars 2019 i mål nr T 3876-18\n[1]* och Södertörns tingsrätts dom den 10 oktober 2019 i mål nr T 5273-19). Under tiden har detta mål varit vilandeförklarat.\nVad parterna har anfört\nParterna har till stöd för sin respektive talan anfört i huvudsak följande.\nGarageföreningen Regnet\nAv gällande plankarta framgår att fastigheten SR 2 är planerad som en enhet tillsammans med radhuskvarteren. Garageföreningen bildades i anslutning till att radhusen byggdes. Av föreningens stadgar framgår att endast de som har radhus i området kan vara medlemmar i föreningen. Garagen är en naturlig och självklar del av bostadsområdet och det behov de täcker är alltjämt gällande.\nUnder årens lopp har garagebyggnaden blivit i allt sämre skick och kring år 2014 började föreningens styrelse fundera på vad som borde göras. Kostnaden för att uppföra nya garage undersöktes. Samtidigt uppvaktades föreningen av byggherrar som visade intresse för att bygga bostäder på marken. En tanke uppstod att låta någon byggherre göra detta och samtidigt tillförsäkra föreningen nya garageplatser inom ramen för projektet. Föreningen kontaktade kommunens stadsbyggnadskontor för att undersöka förutsättningarna för en sådan åtgärd. En projektledare på planavdelningen var positiv till idén och det hölls ett möte med föreningens medlemmar. Projektledaren uppgav att saken måste stämmas av med exploateringskontoret.\nFöreningen kontaktade ett antal byggherrar i frågan och fick svar från bl.a. Seniorgården, Familjebostäder och Svenska Bostäder. Föreningen begärde inte någon ekonomisk ersättning utan var bara intresserad av att säkerställa tillgång till garageplatser. Svenska Bostäder upprättade ett förslag innefattande bostadshus med avskilt garage som skulle kunna hyras av garageföreningen på ett långvarigt kontrakt. Förslaget översändes till föreningen den 23 september 2015 och skulle sedan tas upp med medlemmarna. Den 9 december 2015 tog föreningen emot den i målet klandrade uppsägningen.\nDet tjänsteutlåtande som låg till grund för uppsägningen stämmer inte överens med själva uppsägningshandlingen. I den senare anges att det är av ”stor vikt” för kommunen att fastigheten kan användas för bostadsbebyggelse men det nämns inte i tjänsteutlåtandet. Exploateringsnämnden är inte behörig att avgöra vad som är av stor vikt i sammanhanget. Det är stadsbyggnadsnämnden som ansvarar för planläggning. En relevant avvägning mellan olika intressen inför uppsägning av en tomträtt kan endast göras av kommunfullmäktige.\nI samband med att bostäder i närområdet har uppförts på senare tid (detaljplaner antagna år 2001 och 2012) har behovet av parkeringsplatser tillgodosetts inom planområdena. Uppsägningen av föreningens tomträtt för garageändamål innebär att boende i äldre och nyare bebyggelse behandlas olika.\nVid stadsbyggnadsnämndens programsamråd för Hammarbyhöjden och Björkhagen som godkändes i juni 2015 fanns inte den aktuella platsen med som utvecklingsområde. I förslaget till godkännande av programmet i april 2016, dvs. efter uppsägningen av tomträtten, har platsen tillkommit. Det nämndes dock inget om hur garagebyggnaden skulle ersättas och det saknas överväganden om hur behovet av parkeringsplatser ska tillgodoses.\nAv startpromemoria för planläggning av SR 2 från november 2017 framgår att det aktuella området i november 2016 markanvisades för bostadsbebyggelse till Svenska Bostäder, ett kommunalägt bolag. Föreningens parkeringsbehov tillgodoses varken i planarbetet eller i mark­anvisningen.\nIdén om att utveckla området med bostäder kom alltså ursprungligen från föreningen och föreningen har också på olika sätt verkat konstruktivt för att området ska kunna utvecklas samtidigt som parkeringsplatser behålls. Det har inte varit nödvändigt att säga upp tomträtten för att möjliggöra bostadsbebyggelse. Det har kommunen gjort av ekonomiska skäl.\nStockholms kommun\nUppsägning av tomträtt får ske om det är av vikt för fastighetsägaren, dvs. kommunen, att fastigheten används för bebyggelse av annan art eller på annat sätt än tidigare. Användning för bostadsändamål är en annan typ av användning än för garageändamål. Det är av stor betydelse för kommunen att fastigheten används för bostadsändamål. Bakgrunden till detta framgår av det tjänsteutlåtande som låg till grund för uppsägningen.\nStockholms län har sedan början av 2000-talet upplevt en kraftig befolkningsökning och en stor del av ökningen tillfaller Stockholms kommun. I den översiktsplan som kommunen antog år 2010 bedömdes ökningstakten till ungefär 10 000 nya invånare per år. Behovet av nya bostäder till år 2030 bedömdes uppgå till ca 70 000. I den nya översiktsplan som antogs år 2018 anges att den genomsnittliga befolkningsö­kningen sedan år 2006 varit 15 000 personer per år. Utbyggnadsmålet fram till år 2030 är att 140 000 nya bostäder ska byggas.\nDet yttersta ansvaret för bostadsförsörjningen ligger på kommunen. Planeringen för nya bostäder måste ske med varsamhet. Med hänsyn till det stora behovet måste varenda lämplig plats i hela kommunen användas för bostäder.\nStadsbyggnadsnämnden har som planmyndighet antagit program för\nHammarbyhöjden och Björkhagen. Någon gång från det att samrådshandlingen för planprogrammet togs fram i april 2014 och att den slutliga versionen av programmet upprättades i mars 2016 tog stadsbyggnadskontoret in den aktuella platsen i planeringen. Detta överensstämde med funderingar på exploateringskontoret, vars system under sommaren 2015 varnade för att uppsägningstidpunkten för tomträtten till Regnet 2 närmade sig. De två förvaltningarna tog upp en diskussion med varandra och exploateringskontoret stämde av platsen med stadsbyggnadskontoret. Det var alltså inte så att kommunens intresse för platsen uppstod efter uppsägningen. Exploateringsnämndens roll i kommunen är att som fastighetsägare säkra tillgång till mark och säga upp nyttjanderätter. Detta är inte stadsbyggnadsnämndens uppdrag.\nEnligt kommunens uppfattning ska det inte ske någon intresseavvägning vid uppsägning av tomträtt. För det fall en sådan avvägning ändå ska göras måste hänsyn tas till att behovet av bostäder är akut. Att säga upp tomträtten är det bästa sättet att säkra tillgång till marken för bostadsbebyggelse. Det är inte något som kommunen har gjort för att få ekonomisk vinning. Vad gäller föreningens intresse kommer parkeringssituationen att beaktas i det fortsatta planarbetet. Det finns ingen större risk att garageföreningens medlemmar kommer att sakna parkeringsplatser. Föreningens förslag om bostadsbebyggelse med garageplatser hade krävt en ändring av gällande tomträttskontrakt eftersom det är fråga om en annan användning.\nDomskäl\nHandläggning och utredning\n– – –\nRättsliga utgångspunkter\nAv 13 kap. 13 och 14 §§ JB framgår att tomträtt inte får sägas upp av tomträttshavaren, men att den kan sägas upp av fastighetsägaren vid utgången av vissa tidsperioder.\nDen centrala bestämmelsen i detta mål återfinns i 13 kap. 14 § tredje stycket JB, som anger att uppsägning får ske endast om det är av vikt för ägaren att fastigheten används för bebyggelse av annan art eller eljest på annat sätt än tidigare.\nUppsägning av tomträttsavtal ska ske minst två år före periodens utgång, om inte längre uppsägningstid överenskommits. Uppsägning som sker tidigare än fem år före periodens utgång är utan verkan. Uppsägning ska ske skriftligen. Därvid bör skälen för uppsägningen anges (13 kap. 15 § JB).\nAnser tomträttshavaren att det inte finns skäl för uppsägning, får han eller hon klandra uppsägningen i mark- och miljödomstol (13 kap. 16 och 23 §§ JB).\nDet saknas vägledande rättspraxis när det gäller vilka skäl som kan ligga till grund för uppsägning av en tomträtt. I Hermanssons/Westerlinds kommentar till 13 kap. 14 § tredje stycket JB (version 2, JUNO), med hänvisningar till lagförarbeten (främst SOU 1952:28 och prop. 1953:177), anges bl.a. följande.\nGenom att lagreglera rekvisiten för uppsägning har man velat dels undvika att tomträttshavaren utsätts för godtycke vid uppsägningstillfällena, dels öppna upp för möjligheten till en objektiv prövning av om skäl för uppsägning föreligger. Typfallet då uppsägning ska få ske är att fastigheten ska användas för bebyggelse av annan art än tidigare, t.ex. hyreshus i stället för villor. Även utan att det är fråga om ändring av bebyggelsens art kan det undantagsvis vara så betydelsefullt för ägaren att fastigheten ska få användas på ett annat sätt än förut att uppsägning bör få ske.\nI allmänhet ska alltså fastighetsägarens intresse av att få använda fastigheten tillmätas avgörande betydelse vid bedömningen av om en uppsägning är berättigad. Samtidigt ska tomträttshavaren inte behöva ge upp sin rättighet så snart fastighetsägaren hävdar ett intresse av att disponera över marken, oavsett hur obetydligt detta intresse är. Det måste vara av vikt för fastighetsägaren att få använda fastigheten för egen del.\nI fråga om fastighetsägarens behov av fastigheten kontra tomträttshavarens intresse uttalade Lagberedningen följande:\nUppsägning bör [...] icke tillåtas, när behovet utan större olägenhet kan tillgodoses på annat sätt. I viss utsträckning bör sålunda en intresseavvägning ske. [...] För att uppsägning skall få ske bör icke krävas att fastighetsägarens behov att förfoga över marken vid tiden för uppsägningen står inför sitt omedelbara förverkligande. Å andra sidan är det tydligt att uppsägning icke får tillgripas för ändamål som hänför sig till en oviss framtid. Behovet måste ha vunnit så stark aktualitet, att det kan sägas vara av vikt för fastighetsägaren att redan nu förfoga över marken. Om marken behöver tagas i anspråk först vid en tidpunkt, som ligger långt fram i nästa period, torde det alltså i allmänhet icke kunna anses vara av vikt för fastighetsägaren att tomträtten bringas att upphöra redan vid den löpande periodens utgång. Detta gäller dock icke undantagslöst. Tomträttshavarens intresse av att få behålla tomträtten bör vägas mot angelägenheten av att den åtgärd, som fastighetsägaren ämnar vidtaga med fastigheten, genomföres redan under nästa period. (SOU 1952:28 s. 87).\nEnbart den omständigheten att fastighetsägaren vill byta ut en tomträttshavare mot en annan berättigar inte till uppsägning. Inte heller utgör det förhållandet att det skulle vara ekonomiskt fördelaktigt för fastighetsägaren att sälja fastigheten eller överta en på fastigheten bedriven verksamhet tillräckliga skäl att säga upp tomträtten.\nEnligt Lagberedningens förslag till lagtext skulle uppsägning få ske om ”det är av vikt för ägaren att förfoga över fastigheten för ändamål, som enligt lag må tillgodoses genom expropriation eller annat tvångsförvärv eller som eljest från allmän synpunkt är av väsentlig betydelse”. Vid lagtextens slutliga utformning ansågs det emellertid inte lämpligt att skjuta tvångsförvärvsfallen i förgrunden. Detta berodde på att uppsägningsrätten var avsedd att vara mer vidsträckt än rätten till tvångsförvärv. Det ansågs också finnas en risk att lagtexten fick en mer restriktiv tillämpning än den som var avsedd.\nDet har ansetts onödigt att i lagtexten uttryckligen ange att uppsägning kan ske även om fastighetsägaren inte behöver förfoga över hela fastigheten utan enbart en del av den. I ett sådant fall kan det tänkas att fastighetsägaren är villig att avstå från uppsägning, om parterna kommer överens om att begränsa tomträtten till återstoden av fastigheten (följt av fastighetsbildning, se 13 kap. 21 § JB). Det är också tänkbart att fastighetsägarens intresse i vissa fall kan tillgodoses genom en överenskommelse om ändring i tomträttsavtalets bestämmelser om ändamålet med upplåtelsen eller om fastighetens användning och bebyggelse.\nMark- och miljödomstolens bedömning\nStockholms kommun har som skäl för uppsägningen angett att fastigheten behövs för bostadsändamål i stället för nuvarande garageändamål. Detta framgår såväl av det tjänsteutlåtande som legat till grund för uppsägningen som av den uppsägningshandling som delgetts föreningen. Bostadsbebyggelse är av annan art än garagebebyggelse. Det som återstår för domstolen att pröva är om det är av vikt för kommunen att fastigheten används på angivet sätt.\nGenom den av kommunen åberopade skriftliga och muntliga bevisningen är det klarlagt att det finns ett stort och akut behov av bostäder i hela Stockholm och således även i det område som är aktuellt i målet. Stockholms kommun är ytterst ansvarig för bostadsförsörjningen inom kommunen och har alltså en skyldighet att på de sätt som står till buds möta behovet av bostäder. Domstolen godtar kommunens inställning att varje lämplig plats måste prövas för bostadsbebyggelse. Det förhållandet att bostäder i och för sig kan uppföras även på andra platser än på fastigheten SR 2 innebär således inte att det skulle saknas giltiga skäl att säga upp tomträtten. Med beaktande enbart av vad Stockholms kommun anfört i målet gör domstolen bedömningen att det har varit av vikt för kommunen att fastigheten används för bostadsbebyggelse istället för garagebebyggelse. Domstolen övergår därefter till att pröva de invändningar som garageföreningen framställt mot uppsägningen.\nGarageföreningen har åberopat omständigheter och bevisning till stöd för att bostadsbyggande på fastigheten ursprungligen initierades av föreningen och inte av kommunen. Argumentationen får anses innefatta ett ifrågasättande av kommunens motiv för uppsägningen. Det som anförts av föreningen ger dock inte domstolen anledning att anta annat än att kommunens skäl för uppsägningen faktiskt varit det som uppgetts, nämligen att tillgängliggöra marken för bostadsbebyggelse. Det kan i och för sig inte uteslutas att föreningen genom sina kontakter med olika byggherrar och kommunala tjänstemän kommit att fästa kommunens uppmärksamhet på möjligheten att uppföra bostäder på fastigheten. Detta förtar i så fall inte på något sätt styrkan i kommunens skäl för uppsägningen.\nGarageföreningen har också anfört att det inte har varit nödvändigt att säga upp tomträtten för att kunna bebygga fastigheten med bostäder, utan att detta hade kunnat ske på föreningens initiativ i samarbete med en byggherre. En sådan byggnation hade dock krävt ett nytt tomträttskontrakt, eftersom det kontrakt som gällde vid tidpunkten för uppsägningen endast tillät användning för garageändamål. Det kan enligt domstolens mening inte finnas någon skyldighet för en kommun att, i stället för att säga upp en tomträtt och därmed skaffa sig full rådighet över fastigheten, medverka till upprättande av ett nytt tomträttskontrakt med ett helt annat innehåll än det gällande. Den lösning som föreningen förordat har således inte kunnat komma till stånd med mindre än att kommunen frivilligt gått med på den.\nAv lagtexten framgår inte att det vid prövningen av om skäl för uppsägning föreligger ska ske någon avvägning mellan fastighetsägarens intresse av att säga upp tomträtten och tomträttshavarens intresse av att den ska bestå. Det ligger dock i sakens natur att en viss sådan avvägning måste göras och stöd för detta finns också i lagförarbetena. Vid avvägningen är det garageföreningens intresse av att tomträtten kvarstår för garageändamål som ska beaktas. Intresset kan inte utsträckas till att avse även exploatering för huvudsakligen bostadsändamål. Som angetts ovan skulle detta förutsätta ett nytt tomträttskontrakt, som kommunen inte är skyldig att medverka till.\nÄven om kommunen generellt sett måste anses ha bevisbördan för att tillräckliga skäl för uppsägning föreligger kan en sådan börda inte läggas på kommunen när det gäller omständigheter som tomträttshavaren åberopar angående sina egna intressen. Garageföreningen har inte åberopat någon närmare utredning rörande intresset av att tomträtten består enbart för garageändamål. Trots detta kan domstolen konstatera att det naturligtvis skulle vara en olägenhet för föreningens medlemmar att bli av med sina garageplatser. Det är dock oklart hur stor denna olägenhet faktiskt är och hur stort intresset av att undvika en sådan förlust kan antas vara. Kommunens intresse av att som fastighetsägare skaffa sig full rådighet över marken för bostadsbebyggelse måste under alla förhållanden betraktas som starkare. Det kan i sammanhanget tilläggas att planarbete redan har inletts och att det även i övrigt synes finnas förutsättningar för att genomföra den aktuella åtgärden under kommande tjugoårsperiod.\nGarageföreningen har till stöd för sin talan också gjort gällande att kommunens exploateringsnämnd inte har varit behörig att göra relevanta avvägningar inför beslutet om att säga upp tomträtten. Frågan om exploateringsnämndens formella behörighet att säga upp tomträtten har prövats i allmän domstol (Södertörns tingsrätts dom den \n10 oktober 2019 i mål nr T 5273-19, lagakraftvunnen genom HD:s beslut den 12 juni 2020 om att inte meddela prövningstillstånd). Med den formella behörigheten måste anses följa en materiell behörighet att göra de bedömningar som behöver göras vid en uppsägning av aktuellt slag. Vad föreningen anfört i denna fråga medför således inte att uppsägningen saknat skäl för sig.\nSammanfattningsvis bedömer domstolen att det är av vikt för Stockholms kommun att fastigheten SR 2 används för bostadsbebyggelse i stället för nuvarande garagebebyggelse. Detta har inte utan större olägenhet kunnat åstadkommas på annat sätt än genom uppsägning av tomträtten. Kommunens intresse av att skaffa sig rådighet över marken för bostadsbebyggelse väger tyngre än garageföreningens intresse av att tomträtten för garageändamål ska bestå. Vad föreningen anfört i övrigt innebär inte att det har saknats tillräckliga skäl för uppsägning. För­eningens klandertalan med yrkande om att uppsägningen ska förklaras ogiltig ska därför avslås.\nDomslut\nMark- och miljödomstolen avslår Garageföreningen Regnets klandertalan.\nSvea hovrätt, Mark- och miljööverdomstolen\nGarageföreningen Regnet ekonomisk förening överklagade i Mark- och miljööverdomstolen och yrkade att domstolen skulle fastställa att uppsägningen av tomträtten i fastigheten SR 2 i Stockholms kommun var ogiltig.\nStockholms kommun genom dess exploateringsnämnd motsatte sig ändring av mark- och miljödomstolens dom.\nMark- och miljööverdomstolen (hovrättsrådet Lars Borg, tekniska rådet Ingela Boije af Gennäs och tf. hovrättsassessorn Simon Nesterud, referent) anförde följande i dom den 19 april 2023.\nMark- och miljööverdomstolens domskäl\nInledning\nMark- och miljööverdomstolen har avgjort målet utan huvudförhandling.\nParterna har åberopat samma omständigheter och utvecklat sin talan på i huvudsak samma sätt som i mark- och miljödomstolen. Utredningen är densamma som vid mark- och miljödomstolen. Mark- och miljööverdomstolen har tagit del av den muntliga bevisningen genom uppspelning av ljudfiler från förhören i mark- och miljödomstolen.\nStadsbyggnadskontoret, med det beslutande organet stadsbyggnadsnämnden, ansvarar för den fysiska planeringen i Stockholms kommun medan exploateringskontoret, med det beslutande organet exploateringsnämnden, ansvarar för att utveckla och förvalta de kommunalägda fastigheterna.\nVad gäller frågan om exploateringsnämndens behörighet instämmer Mark- och miljööverdomstolen i mark- och miljödomstolens bedömning att exploateringsnämnden hade behörighet att göra relevanta avvägningar inför beslutet att säga upp tomträtten. Vad föreningen har anfört kring exploateringsnämndens behörighet medför inte att uppsägningen saknat skäl.\nDen centrala frågan i målet är om det är av vikt för kommunen att använda fastigheten för bostadsändamål i stället för garageändamål.\nRättsliga utgångspunkter\nDet är i allmänhet fastighetsägarens intresse av att få använda sin fastighet som ska tillmätas avgörande betydelse vid bedömningen av om en uppsägning är berättigad. Däremot ska inte en tomträttshavare behöva ge upp sin tomträtt så snart fastighetsägaren hävdar ett intresse att disponera marken, oavsett hur obetydligt detta intresse är. (Hermansson & \nWesterlind, Tomträtt [29 nov. 2012, version 2, JUNO], kommentaren till 13 kap. 14 § JB.)\nEn uppsägning får endast ske om det är av vikt för ägaren att fastigheten används för bebyggelse av annan art eller eljest på annat sätt än tidigare (13 kap. 14 § tredje stycket JB). Vad som menas med ”av vikt för ägaren av fastigheten” får ses mot bakgrund av vad som framkommer i förarbetena till bestämmelsen. Där anförs att uppsägningsrätten bör vara mer vidsträckt än rätten till tvångsförvärv (prop. 1953:177 s. 56). Av utredningsbetänkandet till propositionen framkommer även att uppsägning inte bör tillåtas när behovet utan större olägenhet kan tillgodoses på annat sätt. Det bör även beaktas hur aktuellt fastighetsägarens behov är av att redan nu säga upp tomträtten och inte avvakta till utgången av nästkommande period. Det kan dock inte krävas att behovet att förfoga över fastigheten står inför sitt omedelbara förverkligande. (Se SOU 1952:28 s. 87.)\nMark- och miljööverdomstolens bedömning\nI likhet med vad mark- och miljödomstolen har kommit fram till anser Mark- och miljööverdomstolen det utrett att det finns ett stort behov av nya bostäder inom hela Stockholms kommun. Frågan är om det är möjligt att använda just fastigheten SR 2 för att bygga bostäder och när det i så fall kan tänkas bli aktuellt. Att det finns andra platser inom kommunen där bostäder kan uppföras påverkar inte bedömningen av om det finns giltiga skäl att säga upp den aktuella tomträtten för att möjliggöra en ändrad markanvändning.\nEftersom marken är planlagd för garageändamål krävs antagande av en ny detaljplan för att marken ska få användas för annat ändamål. Att kräva av kommunen att det redan vid tidpunkten för uppsägningen hade antagits en ny detaljplan skulle emellertid föra för långt eftersom det skulle innebära att rätten till uppsägning av ett tomträttsavtal i alltför hög utsträckning skulle komma att likställas med rätten till tvångsförvärv, vilket inte är syftet med lagstiftningen (jfr prop. 1953:177 s. 56 f.). Samtidigt behöver det i en situation som nu är för handen finnas ett underlag som visar att planläggningen av den ändrade markanvändningen har påbörjats och att det finns rimliga möjligheter att slutföra den inom en inte alltför oviss framtid.\nVid tidpunkten för uppsägningen den 7 december 2015 omfattades fastigheten av en samrådshandling till planprogram för Hammarbyhöjden och Björkhagen (daterad 2014-05-06). Syftet med planprogrammet var att redovisa förslag till utveckling av stadsdelarna, framför allt gällande byggande av 2 100–2 600 nya bostäder. Fastigheten SR 2 redovisades inte som ett särskilt utredningsområde för bostäder i detta skede. Programförslaget var på samråd 6 maj–29 augusti 2014. I den antagna versionen av planprogrammet är fastigheten sedermera angiven som ett utredningsområde för bostäder. Stadsbyggnadsnämndens antagande av den slutliga versionen av planprogrammet i juni 2016 är således daterat efter uppsägningen av tomträtten.\nI det tjänsteutlåtande som låg till grund för antagandet av (det omarbetade) förslaget till planprogram för Hammarbyhöjden och Björkhagen, daterat 2016-04-18, anges (s. 16) att beslut i stadsbyggnadsnämnden avseende godkännande av programsamrådet togs i juni 2015. Under rubriken ”Revideringar efter beslut i SBN”, redovisas hur uppdraget hanterats efter stadsbyggnadsnämndens godkännande år 2015; bland annat att antalet lägenheter i programmet har utökas från 2 100–2 600 till cirka 2 300–2 700 lägenheter (s. 17). Mellan juni 2015 och fram till färdigställandet av den antagna versionen av planprogrammet presenterades våren 2016, har således ytterligare platser inom programområdet inventerats och bedömts lämpliga för bostadsändamål av stadsbyggnadskontoret.\nI uppsägelsehandlingen av tomträtten angavs att syftet med uppsägningen var att möjliggöra bostadsbyggande. Genom den utredning som finns i målet bedömer Mark- och miljööverdomstolen att kommunen visat att planeringen vid tidpunkten för uppsägningen hade kommit så långt att det fanns konkreta planer på att ändra användningsområdet för fastigheten och att det fanns förutsättningar för bedömningen att marken skulle behövas tas i anspråk för den ändrade användningen under den kommande tjugoårsperioden. Att det inte kommit till uttryck i stadsbyggnadsnämndens planprocess förrän våren 2016 förändrar inte den bedömningen. Kommunen har därmed visat att det föreligger omständigheter som kan berättiga en uppsägning av tomträtten.\nFöreningen har invänt att grunden för uppsägning är en exploatörs önskan att bebygga fastigheten och att uppsägningen därför har skett av ekonomiska skäl och inte varit grundad på ett behov för kommunen att nyttja fastigheten. Mark- och miljööverdomstolen bedömer i likhet med mark- och miljödomstolen att det inte finns tillräckligt stöd i utredningen för en sådan slutsats.\nÄven om tillgången till garageplatser är viktig för föreningens medlemmar bedöms föreningens intresse inte så starkt att kommunens intresse av att få full rådighet över sin mark i syfte att möjliggöra bostäder ska få stå tillbaka.\nSammanfattningsvis instämmer Mark- och miljööverdomstolen i mark- och miljödomstolens bedömning att det är av vikt för kommunen att fastigheten används för bostadsbebyggelse. Vad föreningen har anfört i övrigt ändrar inte bedömningen.\nUppsägningen är därför giltig och mark- och miljödomstolens dom ska fastställas.\nMark- och miljööverdomstolens domslut\nMark- och miljööverdomstolen fastställer mark- och miljödomstolens dom.\nHovrättsrådet Petra Bergman var skiljaktig och anförde följande.\nDen huvudsakliga frågan i målet är under vilka förutsättningar en fastighetsägare får säga upp ett tomträttsavtal. Som majoriteten anfört är det fastighetsägarens intresse av att få använda sin fastighet som ska tillmätas avgörande betydelse vid bedömningen av om en uppsägning av ett tomträttsavtal är berättigad. För att en tomträttshavare inte ska behöva ge upp sin rättighet så snart en fastighetsägare hävdar ett intresse av att få använda marken, anser jag dock att det ankommer på fastighetsägaren att bevisa att det uppgivna behovet – vid tidpunkten för uppsägningen – både är reellt och möjligt att uppfylla inom den kommande avtalsperioden (jfr SOU 1952:28 s. 87). Det bör särskilt noteras att det inte är tomträttshavaren som har bevisbördan för att uppsägningen är ogiltig trots att det ankommer på densamma att väcka talan om klander av uppsägningen (se prop. 1953:177 s. 43 och 74).\nEftersom det krävs en planändring för att kommunen ska kunna använda fastigheten för annat ändamål anser jag att kommunen i vart fall behöver göra sannolikt att en sådan ändring kommer ske under den kommande avtalsperioden – dvs. under den tjugoårsperiod som annars skulle ha gällt från och med 2018. Även om jag instämmer i majoritetens bedömning att det skulle föra för långt att kräva en redan antagen detaljplan från kommunens sida anser jag att det behöver beaktas att det inte kan anses ha varit av vikt för kommunen att använda fastigheten för bebyggelse av annan art eller annars på annat sätt än tidigare för det fall att någon avsedd planändring inte kommer till stånd. Vid bedömningen behöver därför, utöver fastighetens förutsättningar för det nya ändamålet, särskilt beaktas att en planprocess kan pågå under lång tid, att den i sig inte hindras av att det finns en tomträtt i fastigheten och att det är först under genomförandetiden av en lagakraftvunnen detaljplan som den nya användningen av marken kan komma till stånd.\nAv planbeskrivningen till gällande detaljplan från 1956 framgår att garage­längan planlades på platsen för att tillgodose behovet av parkering för boende i planerad och sedermera genomförd radhusbebyggelse eftersom det inte varit möjligt att tillgodose behovet av biluppställningsplatser i direkt anslutning till eller i omedelbar närhet av radhusen. Platsen hade varit avsedd för bostadsbebyggelse tidigare, men inte tagits i anspråk för det eftersom den var så illa belägen. Av handlingarna i målet framgår vidare att garagelängan har ett visst kulturhistoriskt värde och att fastighetens naturvärden behöver beaktas vid planläggning för nytt ändamål.\nAntagande av en ny detaljplan förutsätter beslut av kommunfullmäktige, kommunstyrelse eller byggnadsnämnd (se 5 kap. 27 och 38 §§ plan- och bygglagen [2010:900], PBL). Av 5 kap. 6 § PBL framgår att kommunen, innan antagande av detaljplan, ska ha tagit fram ett planförslag, samrått om förslaget och låtit det granskas. För att underlätta detaljplanearbetet får kommunen ange planens utgångspunkter och mål i ett särskilt program (se 5 kap. 10 § PBL).\nI tjänsteutlåtandet inför kommunens uppsägning av tomträtten anges bland annat följande. Kommunens exploateringskontor har bedömt att fastigheten är mycket lämplig för bostadsbebyggelse och att ett exploateringsprojekt är väl förenligt med Stockholms bostadspolitiska mål. Genom en uppsägning av tomträttsavtalet får kommunen full rådighet över marken samtidigt som en fastighetsutveckling förutsätter en ny detaljplan. Projektets närmare innehåll och utformning kommer att prövas i detaljplaneprocessen. Exploateringskontoret har stämt av föreslagen plats med stadsbyggnadskontoret som är positiva till att pröva bostadsbebyggelse på platsen.\nSåvitt framkommit hade något kommunalpolitiskt ställningstagande till ändring av detaljplanen, t.ex. genom att stadsbyggnadsnämnden gett stadsbyggnadskontoret i uppdrag att påbörja en ny planläggning av fastigheten, ännu inte skett vid uppsägningstidpunkten. Som majoriteten anfört var fastigheten vid denna tidpunkt inte ens utpekad som ett kommande bostadsområde i det ännu ej antagna planprogrammet. Jag anser att de ytterligare steg i planprocessen som tagits, respektive inte tagits, efter uppsägningstidpunkten inte ska beaktas vid bedömningen av kommunens behov av fastigheten i samband med uppsägningen. Enbart den omständigheten att tjänstemännen vid kommunens exploateringskontor bedömt fastighetens lämplighet för bebyggelse och stämt av frågan med tjänstemännen vid stadsbyggnadskontoret är, enligt min mening, inte tillräckligt för att kunna göra en sannolikhetsbedömning av frågan om och i sådant fall när en ny detaljplan för fastigheten skulle kunna antas och vinna laga kraft.\nMot denna bakgrund anser jag att kommunen, varken vid tidpunkten för sin uppsägning eller med hjälp av den bevisning som därefter har förts till målet, har lyckats prestera tillräcklig utredning för att kunna konstatera att det varit av vikt för kommunen att redan under den nu aktuella avtalsperioden få använda fastigheten för bebyggelse av annan art eller annars på annat sätt än tidigare. Den omständigheten att det utan tvekan finns ett behov av nya bostäder inom kommunen föranleder inte någon annan bedömning. Enligt min mening har kommunen därför inte haft giltigt skäl för sin uppsägning och föreningens klandertalan ska därmed bifallas. Överröstad i den delen är jag i övrigt ense med majoriteten.\nHögsta domstolen\nGarageföreningen Regnet ekonomisk förening överklagade och yrkade att HD skulle ändra Mark- och miljööverdomstolens dom och förklara att Stockholms kommuns uppsägning av tomträttsavtalet för fastigheten SR 2 var ogiltig.\nKommunen motsatte sig ändring av Mark- och miljööverdomstolens dom.\nMålet avgjordes efter föredragning.\nFöredraganden, justitiesekreteraren Christoffer Stanek, föreslog i betänkande att HD skulle meddela följande dom.\nDomskäl\nVad målet gäller\nPunkten 1 motsvarar i huvudsak punkten 1 i HD:s domskäl.\nBakgrund\nPunkterna 2–7 motsvarar i huvudsak punkterna 2–7 i HD:s domskäl.\nReglerna om uppsägning av tomträttsavtal\n8. Tomträtt infördes som en nyttjanderätt i lagstiftningen genom 4 kap. lagen (1907:36 s. 1) om nyttjanderätt till fast egendom (nyttjanderättslagen). Den skulle i princip tillgodose samma funktion som äganderätten till fast egendom, i den mån detta kunde ske med hänsyn till samhällets intresse av att få del av markvärdestegringen och vid behov förfoga över marken för något annat viktigt ändamål (jfr bl.a. NJA II 1908 s. 165 ff.).\n9. De nuvarande bestämmelserna om uppsägning av tomträttsavtal går tillbaka på de ändringar som gjordes år 1953 i 4 kap. nyttjanderättslagen. De då tillkomna bestämmelserna ingick i ett regelverk som syftade till att – \nmed bevarande av de grundtankar på vilka tomträttsinstitutet vilar – ge tomträttshavare ett starkare besittningsskydd och öka möjligheterna att använda tomträtten som kreditunderlag (se prop. 1953:177 s. 2 och 62 ff.). Bland annat föreskrevs att tomträttsavtal kunde sägas upp endast av fastighetsägaren till utgången av vissa längre tidsperioder och under vissa förutsättningar.\n10. Enligt 4 kap. 14 § nyttjanderättslagen skulle den första perioden utgöra sextio år räknat från dagen för upplåtelsen eller den senare dag som angetts i upplåtelsen, om inte längre tid hade överenskommits. Om tomträtt upplåtits för väsentligen annat ändamål än bostadsbebyggelse fick kortare tidsperioder överenskommas, dock inte kortare än tjugo år. Uppsägning fick ske endast om det var av vikt för fastighetsägaren att fastigheten skulle användas för bebyggelse av annan art eller annars på annat sätt än tidigare.\n11. Uppsägning skulle enligt 4 kap. 15 § nyttjanderättslagen ske minst två år före respektive periods utgång, om inte längre uppsägningstid överenskommits. I paragrafen föreskrevs också att uppsägning skulle ske skriftligen och att skälen därvid borde anges.\n12. Ansåg tomträttshavaren att skäl för uppsägning inte förelåg, fick han enligt 4 kap. 16 § nyttjanderättslagen inom viss tid klandra uppsägningen.\n13. När jordabalken trädde i kraft den 1 januari 1972 ersattes 4 kap. nyttjanderättslagen av 13 kap. JB. Bestämmelserna om uppsägning av tomträttsavtal i 4 kap. nyttjanderättslagen överfördes då till 13 kap. JB (se 13 kap. 14–16 §§ JB) med endast redaktionella ändringar och någon ändring i sak var inte avsedd (se prop. 1970:20 Del B 1 s. 406 och 416).\n14. Av 34 § lagen (1970:995) om införande av nya jordabalken framgår att äldre bestämmelser ska tillämpas i fråga om nyttjanderätt som har upplåtits före jordabalkens ikraftträdande, om inte annat är särskilt föreskrivet. Några särskilda övergångsbestämmelser avseende uppsägning av tomträttsavtal finns inte (jfr 52 §). Det innebär, i fråga om tomträtter upplåtna under åren 1954–1971, att vad som sägs i 4 kap. 14–16 §§ nyttjanderättslagen gäller i stället för 13 kap. 14–16 §§ JB. Detta saknar emellertid avgörande betydelse, eftersom tidigare och nuvarande lagtexter är avsedda att ha en och samma innebörd. (Se vidare ”Tomträtten i Björkhagen” NJA 2019 s. 223.)\nNärmare om skälen för uppsägning\n15. Förutsättningarna för uppsägning av tomträttsavtal har reglerats närmare i lag för att undvika att uppsägningsrätten används för ovidkommande syften och för att öppna en möjlighet till objektiv prövning av huruvida i det enskilda fallet skäl för uppsägning föreligger. Detta ska bidra till att stärka förtroendet för tomträtten. (Jfr SOU 1952:28 s. 64.)\n16. I linje med de ändamål som ligger till grund för tomträttsreglerna har det ansetts att fastighetsägarens intresse i allmänhet bör tillmätas utslagsgivande betydelse. Samtidigt har det inte ansetts rimligt att tomträttshavaren ska behöva vika så snart det ur allmän synpunkt föreligger ett intresse av att disponera över marken, hur obetydligt detta än må vara. (Se a. bet. a. s.)\n17. Det måste alltså vara av vikt för fastighetsägaren att använda fastigheten för egen del. Med andra ord krävs det i regel att ett betydelsefullt ändamål ur allmän synpunkt påkallar att fastighetsägaren återtar fastigheten (se bl.a. Bertil Bengtsson m.fl., Hyra och annan nyttjanderätt till fast egendom, 10 uppl. 2022, s. 295).\n18. Med dessa utgångspunkter föreslog Lagberedningen i det betänkande som låg till grund för 1953 års ändringar i 4 kap. nyttjanderättslagen att rätt till uppsägning skulle föreligga när fastighetsägaren hade ett behov av att för egen räkning använda fastigheten för ändamål som enligt lag fick tillgodoses genom expropriation eller annat tvångsförvärv eller som annars från allmän synpunkt var av väsentlig betydelse. (Se a. bet. s. 64 f. och 86 f.)\n19. Regeringen ansåg det emellertid inte lämpligt att skjuta tvångsförvärvsfallen i förgrunden, eftersom uppsägningsrätten var avsedd att vara mer vidsträckt än rätten till tvångsförvärv. Det ansågs nämligen inte uteslutet att stadgandet därigenom skulle kunna komma att få en mera restriktiv tillämpning än som var meningen. Lagtexten avfattades därför med direkt sikte på typfallet då uppsägning bör få ske, att fastigheten ska användas för bebyggelse av annan art än tidigare. Som exempel nämndes att fastigheten ska bebyggas med hyreshus i stället för villor. (Se prop. 1953:177 s. 56.)\n20. Mot denna bakgrund bör en utgångspunkt vara att rätt till uppsägning föreligger åtminstone i de fall där den nya användningen för fastigheten utgör ett sådant ändamål som typiskt sett skulle kunna berättiga till tvångsförvärv, t.ex. expropriation enligt expropriationslagen (1972:719) eller ianspråktagande för plangenomförande enligt plan- och bygglagen (2010:900). Rätten till uppsägning är emellertid, som sagt, inte begränsad till dessa fall utan kan föreligga också när något annat intresse av liknande tyngd kräver att fastigheten får en ny användning. (Jfr Magnus Hermansson och Peter Westerlind, Tomträtt. Kommentar till jordabalken 13 kap. 21 kap. m.m., 2 uppl. 2012, s. 163 f.)\n21. Även utan att det är fråga om ändring av bebyggelsens art kan det undantagsvis vara så betydelsefullt för fastighetsägaren att fastigheten används på annat sätt än förut, att uppsägning bör få ske. Med detta torde avses bl.a. avlägsnande av bebyggelse som medför sanitära olägenheter eller väsentliga störningar för omgivningen. (Se a. prop. a. s. och a. bet. s. 87.)\n22. Däremot kan i princip aldrig de förhållandena att fastighetsägaren vill byta ut en tomträttshavare mot en annan eller att det skulle vara ekonomiskt fördelaktigt för fastighetsägaren att sälja fastigheten eller överta en på fastigheten bedriven verksamhet berättiga till uppsägning (se a. bet. s. 65 och 87).\nSärskilt om uppsägningsbehovets aktualitet\n23. För att kunna ge rätt till uppsägning måste fastighetsägarens behov av att själv råda över fastigheten också ha en tillräcklig grad av aktualitet.\n24. Förvisso bör det inte krävas att fastighetsägarens behov av att förfoga över fastigheten vid tiden för uppsägningen står inför sitt omedelbara förverkligande. Uppsägning får emellertid inte användas för ändamål som hänför sig till en oviss framtid. Behovet måste således ha vunnit så stark aktualitet att det kan sägas vara av vikt för fastighetsägaren att redan till utgången av den löpande perioden förfoga över fastigheten. Om fastigheten behöver tas i anspråk först vid en tidpunkt som ligger långt fram i nästa avtalsperiod torde det alltså i allmänhet inte kunna anses vara av vikt för fastighetsägaren att tomträtten bringas att upphöra redan vid den löpande periodens utgång. (Se a. bet. s. 87.)\n25. Något allmänt krav på planläggning i detalj för att det ska kunna avgöras att behovet av fastigheten är så aktuellt att det berättigar till uppsägning bör mot denna bakgrund inte ställas upp (jfr, när det gäller motsvarande bedömning vid det huvudsakliga expropriationsändamålet i 2 kap. 1 § expropriationslagen, bl.a. prop. 1949:184 s. 73 f. och prop. 1971:122 s. 158 f.). Men det är givetvis inte tillräckligt med endast ett påstående från fastighetsägaren om att han behöver ta fastigheten i besittning vid utgången av den löpande avtalsperioden som inte underbyggts på något sätt. I stället måste det som utgångspunkt krävas att fastighetsägaren lägger fram utredning som på ett tillfredsställande sätt visar att det föreligger ett behov av att till den kommande avtalsperioden ta fastigheten i anspråk för det ändamål som det är fråga om. Vilken utredning som närmare krävs får bedömas efter omständigheterna i det enskilda fallet.\nEn intresseavvägning ska i viss utsträckning göras\n26. I kravet på att det ska vara av vikt för fastighetsägaren att själv nyttja fastigheten ligger slutligen att det i viss utsträckning ska göras en avvägning mellan å ena sidan fastighetsägarens intresse av att ta fastigheten i anspråk för den tilltänkta användningen och å andra sidan tomträttshavarens intresse av att få behålla tomträtten.\n27. Om exempelvis fastighetsägarens behov utan större olägenhet kan tillgodoses på annat sätt bör således uppsägning som utgångspunkt inte tillåtas. Likaså bör angelägenheten av att fastighetsägaren redan under nästa avtalsperiod kommer i besittning av fastigheten för att genomföra den planerade åtgärden vägas mot tomträttshavarens intresse av att få fortsätta med den nuvarande användningen av fastigheten. Det krävs emellertid i regel inte, som vid expropriation, att alla andra utvägar att nå det avsedda målet är stängda. Fastighetsägaren har alltså i princip ingen skyldighet att först undersöka om tomträttshavaren på frivillig väg genom ändring i tomträttsavtalet eller på annat sätt kan tillgodose hans intresse. (Se a. bet. s. 87.)\nBedömningen i detta fall\n28. Kommunen har som skäl för att säga upp tomträttsavtalet åberopat att fastigheten ska användas för bostäder i stället för garage. Detta utgör i sig skäl som kan berättiga till uppsägning (jfr p. 19 och 20).\n29. Av utredningen framgår att stadsbyggnadskontoret i kommunen under 2013 påbörjade arbete med att ta fram ett planprogram (jfr 5 kap. 10 § PBL) för området. Syftet med programmet var bl.a. att redovisa förslag till utveckling av området för att bidra till att uppnå bostadsmålet om 140 000 nya bostäder i kommunen till 2030. Programmet var föremål för samråd under 2014 och stadsbyggnadsnämnden i kommunen godkände i juni 2015 redovisningen av samrådet.\n30. I oktober 2015 bedömde kommunens exploateringskontor i samråd med stadsbyggnadskontoret fastigheten som lämplig för bostadsbebyggelse. Exploateringsnämnden i kommunen beslutade därefter att säga upp tomträttsavtalet. Planprogrammet reviderades då också till det slutliga godkännandet i juni 2016 på så sätt att antalet bostäder i programmet utökades genom att bl.a. fastigheten angavs som ny bostadsbebyggelse.\n31. Därefter skedde i november 2016 markanvisning (jfr 1 kap. 4 § PBL) avseende fastigheten till ett kommunalt bostadsbolag och i slutet av 2017 påbörjades detaljplanläggning för att möjliggöra byggande av bostäder på fastigheten.\n32. Genom den framlagda utredningen får kommunen således anses ha styrkt att det förelegat ett behov av att till den kommande avtalsperioden ta fastigheten i anspråk för att bebygga den med bostäder (jfr p. 25).\n33. Föreningens medlemmar har självfallet ett intresse av att även fortsättningsvis nyttja fastigheten för att tillgodose sitt behov av parkering. Detta intresse är emellertid uppenbarligen inte sådant att kommunen nu inte ska få säga upp tomträttsavtalet för att bygga bostäder på fastigheten. Att också andra fastigheter skulle kunna exploateras för bostäder innebär inte i sig att kommunens behov utan olägenhet kan tillgodoses på annat sätt. Inte heller i övrigt har några bärande skäl mot uppsägning framkommit. (Jfr p. 27–29.)\n34. Det nu anförda leder till slutsatsen att det föreligger förutsättningar för kommunen att säga upp tomträttsavtalet.\n35. Mark- och miljööverdomstolens domslut ska därför fastställas. – – –\ndomslut\nHD fastställer Mark- och miljööverdomstolens domslut.\nHD (justitieråden Anders Eka, Agneta Bäcklund, Stefan Johansson, Petter \nAsp och Margareta Brattström, referent) meddelade den 17 december 2024 följande dom.\nDomskäl\nVad målet gäller\n1. Målet gäller under vilka förutsättningar en fastighetsägare är berättigad att säga upp ett tomträttsavtal som avser annat ändamål än bostadsbebyggelse.\nBakgrund\n2. Kommunen äger fastigheten SR 2. Fastigheten omfattas av en stadsplan från 1956. Enligt stadsplanen ska marken användas för garageändamål.\n3. Fastigheten är genom avtal, som undertecknades i oktober 1957, upplåten till föreningen med tomträtt. Upplåtelsen har skett för garage­ändamål. På fastigheten har föreningen uppfört en garagelänga med tjugotvå bilplatser.\n4. Enligt avtalet kan det sägas upp till utgången av vissa angivna tidsperioder. Den första perioden var fyrtio år och skulle räknas från den \n1 januari 1958. Avtalsperioderna har därefter varit tjugo år.\n5. Kommunen sade i december 2015 upp avtalet till utgången av den då löpande tjugoårsperioden, dvs. den 31 december 2017. Som skäl för uppsägningen angav kommunen att det finns behov av att använda fastigheten för bostäder i stället för garage.\n6. Föreningen väckte talan och yrkade att uppsägningen skulle förklaras ogiltig. Föreningen gjorde gällande att det inte förelåg skäl enligt 13 kap. 14 § JB för uppsägning, bland annat för att kommunens planer på ändrad markanvändning inte hade tillräcklig aktualitet.\n7. Såväl mark- och miljödomstolen som Mark- och miljööverdomstolen har funnit att förutsättningarna i 13 kap. 14 § JB har varit uppfyllda och därför ogillat föreningens talan.\nTillämplig lag\n8. Mark- och miljödomstolen och Mark- och miljööverdomstolen har prövat målet enligt bestämmelserna om tomträtt i 13 kap. JB.\n9. Jordabalken trädde i kraft den 1 januari 1972. Innan dess reglerades tomträtt i 4 kap. lagen (1907:36 s. 1) om nyttjanderätt till fast egendom (nyttjanderättslagen).\n10. Kommunen och föreningen ingick avtalet 1957. Av jordabalkens övergångsbestämmelser framgår att nyttjanderättslagen ska tillämpas på avtalet (se 34 och 52 §§ lagen, 1970:995, om införande av nya jordabalken).\n11. I samband med att jordabalken infördes flyttades reglerna om tomträtt i nyttjanderättslagen så gott som oförändrade över till balken (se prop. 1970:20 del B s. 406). Lagtexten i nyttjanderättslagen och jordabalken har i här relevanta delar samma innebörd.\nAllmänt om tomträtt\n12. Med tomträtt avses nyttjanderätt till fastighet som upplåts under obestämd tid för visst ändamål mot årlig avgäld i pengar. Tomträtt får endast upplåtas i en fastighet som ägs av det allmänna, eller i vissa fall av en stiftelse. (Se 4 kap. 1 och 2 §§ nyttjanderättslagen respektive 13 kap. 1 och 2 §§ JB.)\n13. Tomträttsinstitutet infördes i början av 1900-talet med syfte att främst underlätta byggandet av bostäder. Detta skulle åstadkommas genom att ge nyttjanderättshavaren en långsiktigt säkrad markåtkomst, med en låg initial kostnad i jämförelse med köp av mark. Samtidigt skulle samhället få del av den framtida avkastningen av fastigheten och möjlighet att återta den om marken med tiden skulle komma att behöva användas för annat ändamål. (Se NJA II 1908 s. 165 ff.)\n14. När bestämmelserna om tomträtt reformerades under 1950-talet var syftet att genom vissa inskränkningar i parternas avtalsfrihet stärka tomträttshavarens rättsliga ställning och därmed tomträttens värde som kreditobjekt. Fastighetsägarens rätt att säga upp ett tomträttsavtal begränsades och det infördes ett förbud för tomträttshavaren att säga upp tomträttsavtalet. Grundtankarna som systemet vilade på skulle emellertid bestå. (Se 4 kap. 13 och 14 §§ nyttjanderättslagen respektive 13 kap. 13 och 14 §§ JB samt prop. 1953:177 s. 2 och 62 ff.)\nUppsägning av tomträttsavtal\n15. En tomträtt kan sägas upp endast till utgången av vissa tidsperioder. Tidsperioderna skiljer sig åt beroende på ändamålet med upplåtelsen. För bostadsbebyggelse är den första tidsperioden sextio år och därefter fyrtio år, om inte längre perioder har överenskommits. När tomträtt har upplåtits för väsentligen annat ändamål är avtalsfriheten större, tidsperioden får dock inte vara kortare än tjugo år. (Se 4 kap. 14 § nyttjanderättslagen respektive 13 kap. 14 § JB.)\n16. Uppsägning ska ske minst två år före utgången av en tidsperiod. Längre uppsägningstid kan avtalas, dock inte längre än fem år. En uppsägning ska ske skriftligen och skälen bör anges. (Se 4 kap. 15 § nyttjanderättslagen respektive 13 kap. 15 § JB.)\n17. Oberoende av upplåtelseändamål förutsätter en uppsägning att det är av vikt för fastighetsägaren att fastigheten används för bebyggelse av annan art eller annars på annat sätt än tidigare. En tomträttshavare som anser att skäl för uppsägning inte föreligger kan klandra uppsägningen genom att inom viss tid väcka talan. Domstolen ska göra en prövning av om det objektivt sett föreligger skäl för uppsägning. (Jfr 4 kap. 14 och 16 §§ nyttjanderättslagen respektive 13 kap. 14 och \n16 §§ JB.)\nNärmare om förutsättningarna för uppsägning\n18. Att det ska vara av vikt för fastighetsägaren att använda fastigheten på annat sätt än tidigare tar i första hand sikte på situationer där det är av betydelse från allmän synpunkt att fastighetsägaren återtar fastigheten. Ett typfall på en situation där uppsägning kan ske är att en fastighet behöver användas för bostadsbebyggelse (jfr prop. 1953:177 s. 56).\n19. I kravet på att det ska vara av vikt för ägaren att själv nyttja sin fastighet ligger ett inslag av avvägning mellan å ena sidan fastighetsägarens intresse av att ta fastigheten i anspråk för den tilltänkta användningen och å andra sidan tomträttshavarens intresse av att få behålla tomträtten.\n20. Om tomträttshavaren bedöms ha ett starkt intresse av att behålla nyttjanderätten och fastighetsägarens behov utan större olägenhet kan tillgodoses på annat sätt, kan det utgöra en situation där skäl för uppsägning inte föreligger.\n21. Det krävs inte att uppsägning av tomträttsavtalet är det enda sättet på vilket fastighetsägarens behov kan tillgodoses. Fastighetsägaren har som utgångspunkt inte heller någon skyldighet att undersöka om ändrad markanvändning kan komma till stånd genom en överenskommelse med tomträttshavaren om ändring av tomträttsavtalet.\n22. Eftersom det vid tomträtt är fråga om långa avtalsperioder kan det inte vid tiden för uppsägningen krävas att fastighetsägarens behov av att förfoga över fastigheten står inför sitt omedelbara förverkligande. Om fastigheten behöver tas i anspråk först mot slutet av nästa avtalsperiod kan det vara en omständighet som gör att det inte kan anses vara av vikt för fastighetsägaren att tomträtten upphör redan vid den pågående periodens utgång. Uppsägning får inte användas med hänvisning till ändamål som hänför sig till en oviss framtid. (Jfr SOU 1952:28 s. 87.)\n23. Mot bakgrund av det anförda kan det inte ställas upp något krav på att det föreligger en mer detaljerad planering rörande fastighetens framtida användning. Som utgångspunkt måste det dock krävas att fastighetsägaren presenterar underlag som på ett tillfredsställande sätt visar att det föreligger ett behov av att under den kommande perioden ta fastigheten i anspråk för det ändamål som det är fråga om.\nBedömningen i detta fall\n24. Kommunen har som skäl för att säga upp tomträttsavtalet åberopat att fastigheten ska användas för bostäder i stället för garage. Det är ingen tvekan om att det finns ett behov av att bygga ytterligare bostäder i kommunen.\n25. Av det skälet påbörjades 2013 ett arbete med att ta fram ett planprogram för området (jfr 5 kap. 10 § PBL). I oktober 2015 bedömde kommunen att den aktuella fastigheten var lämplig för bostadsbebyggelse. Tomträttsavtalet sades upp i december samma år. Därefter har kommunen tagit initiativ till att påbörja detaljplanläggning för att möjliggöra byggande av bostäder på fastigheten.\n26. Det står klart att kommunens behov av att använda fastigheten är tillräckligt nära förestående och att kommunens intresse väger betydligt tyngre än föreningens.\n27. Överklagandet ska därmed avslås – – –.\nDomslut\nHD avslår överklagandet.\n\n [1] NJA 2019 s. 223 (red:s anm.).\n- Visa mindre innehåll\nDom eller beslut\npicture_as_pdf\nT 3537-23.pdf\narrow_forward\nÖppnas i en ny flik\nKontakt\nFrågor och svar\nTillgänglighet\nPrenumerera på RSS-flöde"
}