{
  "case_number": "Ä 3500-24",
  "nickname": "”Översändandet av fängelsedomen”",
  "summary": "Erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen. Undantag från kravet på medgivande av den andra staten och samtycke av den dömde vid utvisning på grund av brott förutsätter att utvisningsbeslutet finns i den dom som ska sändas över. Det gäller även om utvisning har beslutats i en tidigare brottmålsdom.  ",
  "decision_date": "2024-11-28",
  "publication_time": "2025-04-12T07:21:00",
  "case_id": "2661154d-f308-4520-afcb-ffaaa16a54c2",
  "type": "DOM_ELLER_BESLUT",
  "is_precedent": true,
  "court": "Högsta domstolen",
  "court_code": "HDO",
  "keywords": [
    "Erkännande och verkställighet",
    "Medgivande från verkställande medlemsstat",
    "Samtycke från den dömde",
    "Utvisning på grund av brott"
  ],
  "legal_areas": [],
  "legal_references": [
    {
      "reference": "2 kap. 2 § lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen",
      "sfs_number": "2015:96"
    },
    {
      "reference": "2 kap. 3 § lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen",
      "sfs_number": "2015:96"
    }
  ],
  "referenced_publications": [],
  "pdf_documents": [
    {
      "filename": "Ä 3500-24.pdf",
      "file_id": "190/59/36/59366c09-f8c9-4ea8-bd9d-644ae15c3537"
    }
  ],
  "case_url": "https://rattspraxis.etjanst.domstol.se/sok/publicering/c26b9880-c3ff-41ef-a59d-5a27debbdfc9",
  "correlation_number": "c26b9880-c3ff-41ef-a59d-5a27debbdfc9",
  "full_text": "Sök rättspraxis\nTillbaka\nSkriv ut\nOm avgörandet\nDomstol:\nHögsta domstolen\nMålnummer:\nÄ 3500-24\nReferatnummer:\nNJA 2024:61\nNJA 2024 s. 772\nAvgörandedatum:\n2024-11-28\nLagrum\n2 kap. 2 § lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen\n2015:96\n2 kap. 3 § lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen\n2015:96\nNyckelord\nErkännande och verkställi...\nMedgivande från verkställ...\nSamtycke från den dömde\nUtvisning på grund av bro...\nNJA 2024:61, NJA 2024 s. 772\n”Översändandet av fängelsedomen”\nErkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen. Undantag från kravet på medgivande av den andra staten och samtycke av den dömde vid utvisning på grund av brott förutsätter att utvisningsbeslutet finns i den dom som ska sändas över. Det gäller även om utvisning har beslutats i en tidigare brottmålsdom.\nReferat\nSolna tingsrätt\nSolna tingsrätt antecknade följande i ett handläggningsprotokoll den 18 mars 2024.\nSolna tingsrätt dömde den 11 oktober 2023 B.A.G. till fängelse i sju år för två fall av grov våldtäkt, försök till rån samt ringa narkotikabrott. Det beslutades vidare att han skulle utvisas ur riket och förbjudas att återvända hit.\nKriminalvården beslutade den 7 december 2023 att översända intyg och Solna tingsrätts dom av den 11 oktober 2023 till Spanien för erkännande i enlighet med lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen (europeiska verkställighetslagen). B.A.G. överklagade Kriminalvårdens beslut. Södertörns tingsrätt avslog den 7 februari 2023 B.A.G:s överklagande (mål B 617-24) och beslutet har vunnit laga kraft.\nSolna tingsrätt dömde den 21 december 2023 (mål B 8637-23) B.A.G. till fängelse i ett år och sex månader för grov våldtäkt och försök till rån. Brotten hade begåtts före domen från den 11 oktober 2023 och det var alltså fråga om nyupptäckt brottslighet.\nKriminalvården beslutade den 24 januari 2024 att översända intyg och domen till Spanien för erkännande och verkställighet i enlighet med europeiska verkställighetslagen.\nB.A.G. har nu överklagat beslutet och genom sitt offentliga biträde sammanfattningsvis framfört följande skäl till att ett överförande inte ska ske.\nHan har hela sin familj i Sverige. Det är såväl hans pappa och dennes fru, hans mamma, syskon och kusiner som alla bor i Sverige. Han har varit bosatt i Sverige i fem år medan resten av hans familj har varit bosatta i Sverige i cirka tio år. Han är medveten om att han kommer utvisas ur Sverige efter avtjänat straff men om han kommer överflyttas dit redan nu kommer han inte kunna ha kontakt med någon i sin familj. Åtta och ett halvt år är en lång tid att inte ha en sådan kontakt. Till följd av detta kommer ingen att besöka honom i fängelset eller hjälpa honom med anpassningen till ett liv i frihet. Kontakten med familjen är av vikt för att underlätta hans sociala återanpassning till samhället. Därmed är inte förutsättningarna för att överföra verkställigheten av hans dom till Spanien uppfyllda. Utöver detta har han tidigare i Spanien varit medlem i ett kriminellt gäng. När han kom till Sverige så flydde han från detta gäng. Skulle han avtjäna sitt straff i spanskt fängelse kommer han att tvingas av gängmedlemmar att bli aktiv medlem igen vilket kommer leda till problem med andra gäng som också finns i spanska fängelser. Det kan därför inte anses lämpligt att han överförs till Spanien för verkställighet.\nKriminalvården har överlämnat överklagandet till tingsrätten för prövning.\nB.A.G. har beretts möjlighet att yttra sig.\nTingsrätten (rådmannen Helene Karlsson) avslog överklagandet i beslut den 18 mars 2024.\nSkälen för tingsrättens beslut\nRättslig reglering\nFör att en dom på frihetsberövande påföljd ska få sändas över till en annan medlemsstat för att där erkännas och verkställas krävs enligt 2 kap. 1 § i europeiska verkställighetslagen\n1. att den dömde befinner sig i den andra medlemsstaten eller i Sverige,\n2. att förutsättningarna i 2 och 3 §§ i europeiska verkställighetslagen är uppfyllda,\n3. att den dömdes sociala återanpassning underlättas av att verkställigheten överförs dit, samt\n4. att det i övrigt är lämpligt.\nAv 2 kap. 2 § europeiska verkställighetslagen framgår bl.a. att en dom får sändas över enligt 1 § om den behöriga myndigheten i den andra medlemsstaten lämnat sitt medgivande därtill. Medgivande krävs emellertid inte om den dömde bl.a. är medborgare och bosatt i den andra medlemsstaten eller är medborgare i den andra medlemsstaten och efter verkställigheten av påföljden kommer att utvisas dit till följd av ett utvisningsbeslut i domen.\nAv 2 kap. 3 § europeiska verkställighetslagen framgår att en dom får sändas över till en annan medlemsstat om den dömde samtycker till detta. Samtycke krävs dock inte om den dömde bl.a. är medborgare i och bosatt i den andra medlemsstaten eller är medborgare i den andra medlemsstaten och efter verkställigheten av påföljden kommer att utvisas dit till följd av ett i domen meddelat beslut om utvisning.\nVid bedömningen av om förutsättningarna för ett överförande är uppfyllda ska en helhetsbedömning göras utifrån samtliga omständigheter i det enskilda fallet. Den dömdes anknytning till Sverige respektive den andra medlemsstaten beaktas särskilt, där faktorer som medborgarskap, bosättningstid samt familjeförhållanden tillmäts stor vikt. Är den dömde medborgare i den mottagande medlemsstaten och har ett utvisningsbeslut till staten meddelats i domen, råder en stark presumtion för att den sociala återanpassningen sker på bästa sätt i den mottagande staten (se prop. 2014/15:29 s. 174 ff.).\nÖverförande av verkställighet får aldrig ske om förhållandena är sådana att det föreligger hinder mot att verkställa beslut om utvisning till den andra medlemsstaten, om överföringen skulle strida mot svensk grundlag eller om den står i strid med Europakonventionen (se prop. 2014/15:29 s. 175).\nTingsrättens bedömning\nB.A.G. är medborgare i Spanien. Solna tingsrätt har i sin dom den \n11 oktober 2023 beslutat att B.A.G. ska utvisas ur riket och förbjudas att återvända hit, utan någon begränsning i tid.\nDen dom från Solna tingsrätt som ligger till grund för det nu överklagade beslutet från kriminalvården innehåller inte något beslut om utvisning. Enligt ordalydelsen i 2 kap. 2 och 3 §§ andra stycket andra punkten i europeiska verkställighetslagen framgår att undantag från medgivande respektive samtycke gäller om den dömde efter verkställigheten av påföljden kommer att utvisas till den andra medlemsstaten till följd av ett i domen meddelat beslut om utvisning enligt 8 a kap. utlänningslagen (2005:716). Formuleringen i lagtexten talar närmast för att det inte skulle vara möjligt att tillämpa nämnda undantag i ett fall som detta, där den dömde dömts för nyupptäckt brottslighet efter en tidigare dom och den dömde utvisats genom ett beslut i den första domen men inte i den senare. Detta då den dömde inte utvisats till följd av ett i domen meddelat beslut utan till följd av ett beslut om utvisning i en tidigare meddelad dom.\nDet finns dock enligt tingsrätten flera skäl som talar mot en tillämpning av de aktuella bestämmelserna som innebär att det alltid krävs att utvisningsbeslutet fattats i den aktuella domen för att domen ska få översändas till en annan medlemsstat för erkännande och verkställighet.\nB.A.G. har dömts för brott till fängelse vid två olika tillfällen inom loppet av tre månader och kriminalvården har upprättat ett strafftidsbeslut som omfattar påföljderna i båda domarna. En sådan tillämpning av de aktuella bestämmelserna som nämnts ovan skulle innebära att B.A.G. enligt tidigare lagakraftvunnet beslut kan överföras för att verkställa den del av fängelsestraffet som utdömts genom den första domen (sju år) men att han inte utan hans samtycke och medgivande från spanska myndigheter kan överföras för att verkställa den andra delen av straffet (ett år och sex månader). Det skulle alltså kunna bli fråga om att endast delar av ett fängelsestraff kan verkställas i den medlemsstat som den dömde är medborgare i och som denne ska utvisas till. En sådan ordning kan inte rimligen ha varit avsedd från lagstiftarens sida.\nHuvudregeln är att åtal mot en tilltalad för flera brott ska prövas i en och samma rättegång. Hade så skett beträffande B.A.G:s brottslighet skulle de brott som han dömts för genom den senare domen ha prövats i den första domen tillsammans med begäran om utvisning. I ett sådant fall skulle undantagsbestämmelserna i europeiska verkställighetslagen vara tillämpliga på hela fängelsestraffet. En ordning som innebär att undantagsbestämmelsernas tillämplighet blir beroende av tillfälliga omständigheter, huruvida viss brottslighet prövas i en rättegång eller i flera, framstår inte som önskvärd. I detta avseende ska det också beaktas att det i förarbetena till europeiska verkställighetslagen framgår att det beträffande dömda personer som har en sådan närmare anknytning till en annan stat som anges i de nu aktuella undantagsbestämmelserna finns en presumtion om att den sociala återanpassningen sker bäst i den medlemsstaten och att det därför inte ska vara den andra staten som avgör om den dömdes sociala återanpassning gynnas (prop. 2014/15:29 s. 176). En tillämpning av de aktuella bestämmelserna som innebär att det alltid krävs att utvisningsbeslutet fattats i den aktuella domen för att domen ska få översändas till en annan medlemsstat för erkännande och verkställighet skulle alltså i ett fall som det nu aktuella innebära att presumtionen frångås och att syftet med regleringen inte uppnås.\nBestämmelserna i europeiska verkställighetslagen genomför Rådets rambeslut 2008/909/RIF av den 27 november 2008 om tillämpning av principen om ömsesidigt erkännande på brottmålsdomar avseende fängelse eller andra frihetsberövande åtgärder i syfte att verkställa dessa inom Europeiska unionen (rambeslutet om verkställighet av frihetsberövande påföljder). Vid tillämpningen av de svenska bestämmelserna i europeiska verkställighetslagen måste tingsrätten så långt möjligt tolka dessa bestämmelser i enlighet med bestämmelserna i rambeslutet.\nSamarbetet som rör överförande av frihetsberövande påföljder bygger på grundtanken att den dömde bör verkställa sitt straff i den stat där han eller hon har de bästa förutsättningarna att återanpassa sig till ett normalt liv när verkställigheten avslutas. Rambeslutet bygger på principen om ömsesidigt erkännande som är en grundläggande princip för det straffrättsliga samarbetet inom EU. Principen innebär att den stat som ska verkställa en annan stats dom eller beslut inte ska ifrågasätta domen eller beslutet eller under vilka förutsättningar dessa har meddelats. Principen förutsätter således ett ömsesidigt förtroende mellan medlemsstaterna för varandras straffrättsliga system.\nBestämmelserna i 2 kap. 2 och 3 §§ andra stycket andra punkten i europeiska verkställighetslagen genomför artiklarna 4.1 b) och 6.1 b) i rambeslutet om verkställighet av frihetsberövande påföljder. I dessa artiklar anges att medgivande och samtycke inte krävs om den dömda personen kommer att utvisas eller avvisas när han eller hon friges efter verkställigheten av påföljden på grund av ett utvisnings- eller avvisningsbeslut eller ett annat beslut om avlägsnande som ingår i domen eller i ett rättsligt eller ett administrativt beslut eller någon annan åtgärd som vidtas till följd av domen.\nTingsrätten konstaterar att bestämmelserna i rambeslutet synes ha ett vidare tillämpningsområde än de svenska lagbestämmelserna genom att det inte finns något krav på att utvisnings- eller avvisningsbeslutet ska ha meddelats i domen. Att det förhåller sig på det sättet framstår också som naturligt med tanke på att de rättsliga regelverken och förfarandena gällande utvisnings- och avvisningsbeslut kan se mycket olika ut i EU-medlemsstaterna.\nI lagrådsremissen som låg till grund för lagförslaget om den europeiska verkställighetslagen hade regeringen föreslagit att de aktuella bestämmelserna skulle formuleras på så sätt att en dom kan sändas över till en annan medlemsstat för erkännande och verkställighet utan medgivande och samtycke om den dömde kommer att utvisas till den andra medlemsstaten efter det att påföljden har verkställts med stöd av ett beslut om utvisning på grund av brott enligt 8 a kap. utlänningslagen (2005:716). (Se Lagrådsremiss Erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen). Det var efter synpunkter från Lagrådet, som ansåg att bestämmelserna borde utformas i närmare anslutning till artiklarna i rambeslutet, som bestämmelserna fick sin nuvarande lydelse.\nAv handlingarna i målet framgår att B.A.G., som är medborgare i Spanien, har påbörjat verkställigheten av de båda utdömda fängelsestraffen i Sverige. Vidare framgår att han när han friges efter verkställigheten av fängelsestraffet kommer att utvisas till Spanien. Frågan är då om Solna tingsrätts dom av den 21 december 2023 kan sändas över till Spanien för erkännande och verkställighet utan medgivande från behöriga myndigheter i Spanien och utan samtycke från B.A.G. med stöd av bestämmelserna i 2 kap. 2 och 3 §§ andra stycket andra punkten i europeiska verkställighetslagen.\nMot bakgrund av vad som anförts ovan och vid en sammantagen bedömning av de aktuella svenska bestämmelserna, med beaktande av rambeslutets utformning och syfte, anser tingsrätten att bestämmelserna i 2 kap. 2 och 3 §§ andra stycket andra punkten i europeiska verkställighetslagen ska tolkas så att det i detta fall inte krävs något medgivande från behöriga myndigheter i Spanien eller något samtycke från B.A.G. för att domen ska få översändas till Spanien för erkännande och verkställighet.\nEtt överförande får då ske om B.A.G:s sociala återanpassning underlättas av att verkställigheten överförs till Spanien samt om det i övrigt är lämpligt. Som tingsrätten beskrivit ovan råder det en stark presumtion för att den sociala återanpassningen till samhället bäst sker i den stat där den dömde är medborgare (se NJA 2017 s. 300). Tingsrätten bedömer inte att de omständigheter som B.A.G. nu har framfört väger tillräckligt tungt för att bryta denna presumtion. Då det även i övrigt är lämpligt att en överföring sker, ska kriminalvårdens beslut inte ändras.\nSvea hovrätt\nB.A.G. överklagade tingsrättens beslut i Svea hovrätt.\nHovrätten (hovrättslagmannen Erik Lindberg samt hovrättsråden Sara \nLindqvist och Viktoria Thörnqvist, referent) anförde följande i beslut den 11 april 2024.\n1. Hovrätten ger prövningstillstånd.\n2. Hovrätten gör ingen annan bedömning än tingsrätten och avslår överklagandet. Tingsrättens beslut står därmed fast.\nHögsta domstolen\nB.A.G. överklagade och yrkade att HD skulle upphäva Kriminalvårdens beslut att översända Solna tingsrätts dom i mål B 8637-23, tillsammans med intyg, till Spanien för erkännande och verkställighet.\nKriminalvården motsatte sig att beslutet upphävdes.\nHD meddelade prövningstillstånd beträffande frågan om det krävs samtycke från B.A.G. och medgivande från den behöriga myndigheten i Spanien för att översända domen dit för erkännande och verkställighet. Frågan om prövningstillstånd rörande målet i övrigt förklarades vilande.\nMålet avgjordes efter föredragning.\nFöredraganden, justitiesekreteraren Dennis Andreev, föreslog i betänkande att HD skulle meddela beslut i huvudsaklig överensstämmelse med HD:s beslut.\nHD (justitieråden Gudmund Toijer, Dag Mattsson, Malin Bonthron, Christine Lager, referent, och Anders Perklev) meddelade den 28 november 2024 följande beslut.\nSkäl\nBakgrund\n1. B.A.G. är medborgare i Spanien. Han har bott i Sverige sedan 2019.\n2. Den 11 oktober 2023 dömdes B.A.G. för bland annat grov våldtäkt till fängelse i sju år. I domen bestämdes att han skulle utvisas ur Sverige och förbjudas att återvända hit utan tidsbegränsning. Kriminalvården beslutade därefter att översända domen till Spanien för erkännande och verkställighet. Såväl domen som Kriminalvårdens beslut har fått laga kraft.\n3. B.A.G. dömdes på nytt den 21 december 2023 för grov våldtäkt och försök till rån. Brotten hade begåtts före domen den 11 oktober 2023. Brotten hade från början omfattats av åtalet enligt den första domen, men, på grund av att målsäganden då inte varit delgiven, avskilts för att handläggas separat. I domen angavs därför, med hänvisning till 34 kap. 1 § första stycket och 2 § BrB, att brotten utgjorde nyupptäckt brottslighet, att ny påföljd bestämdes för denna brottslighet och att hänsyn tagits till påföljden enligt den tidigare domen. Påföljden bestämdes till fängelse i ett år och sex månader. Domen innehöll inget beslut om utvisning. Även denna dom har fått laga kraft.\n4. Kriminalvården meddelade ett strafftidsbeslut som omfattade båda domarna. Därefter beslutade Kriminalvården att översända också den andra domen för erkännande och verkställighet till Spanien. Det saknades samtycke från B.A.G. och medgivande från den behöriga myndigheten i Spanien. Kriminalvården bedömde att varken samtycke eller medgivande krävdes eftersom B.A.G. skulle utvisas ur Sverige efter avtjänat fängelsestraff.\n5. Såväl tingsrätten som hovrätten har fastställt Kriminalvårdens beslut. Domstolarna har kommit fram till att domen från december 2023 kan översändas för erkännande och verkställighet till Spanien utan samtycke och medgivande, trots att den inte innehåller något beslut om utvisning. Domstolarna har bland annat hänvisat till att Kriminalvården har meddelat ett strafftidsbeslut som omfattar både den tidigare domen med utvisningsbeslutet och den nu aktuella domen, att huvudregeln är att åtal mot en tilltalad ska prövas i en rättegång, att de svenska bestämmelserna ska tolkas mot bakgrund av ett rambeslut och att rambeslutet synes ha ett vidare tillämpningsområde genom att det inte har något krav på att utvisningsbeslutet ska ha meddelats i domen.\nPrövningstillståndet och prejudikatfrågan\n6. HD har meddelat prövningstillstånd beträffande frågan om det krävs samtycke från B.A.G. och medgivande från den behöriga myndigheten i Spanien för att översända domen dit för erkännande och verkställighet. Frågan om prövningstillstånd rörande målet i övrigt har förklarats vilande.\n7. Prejudikatfrågan är om de undantagsbestämmelser som finns från kraven på medgivande och samtycke är tillämpliga när den dömde utvisas ur Sverige genom ett beslut i en annan brottmålsdom än den dom som ska sändas över till en annan medlemsstat för att där erkännas och verkställas.\nDen rättsliga regleringen\nDen svenska lagstiftningen och rambeslutet\n8. Lagen (2015:96) om erkännande och verkställighet av frihetsberövande påföljder inom Europeiska unionen genomför ett rambeslut från 2008[1]. Reglerna syftar till att underlätta den dömdes sociala återanpassning. För att en dom ska få sändas över krävs som utgångspunkt därför såväl medgivande från den behöriga myndigheten i den verkställande staten som samtycke från den dömde. (Se 1 kap. 1 §, 2 kap. 1 § 3, 2 § första stycket och 3 § första stycket samt artiklarna 3.1, 4.1 c och 6.1 i rambeslutet.)\n9. Rambeslutet innehåller vissa undantag från kraven på medgivande och samtycke. Om den dömde är medborgare i den andra medlemsstaten men inte bosatt där får domen sändas över dit, förutsatt att den dömde ska utvisas till den andra medlemsstaten på grund av ett beslut som ingår i domen eller i ett rättsligt eller ett administrativt beslut eller någon annan åtgärd som vidtas till följd av domen (se artiklarna 4.1 b och 6.2 b).\n10. Undantagen är genomförda i svensk rätt genom att det i lagtexten anges att medgivande och samtycke inte krävs om den dömde är medborgare i den andra staten och efter verkställigheten av påföljden kommer att utvisas dit till följd av ”ett i domen meddelat beslut om utvisning” enligt 8 a kap. utlänningslagen (2005:716), se 2 kap. 2 § andra stycket 2 och 3 § andra stycket 2.\n11. I den lagrådsremiss som föregick det svenska genomförandet hade undantagsbestämmelserna en vidare ordalydelse. Där fanns inget krav på att utvisningsbeslutet skulle vara meddelat i domen. Lagrådet angav emellertid att undantagsbestämmelserna borde utformas i närmare anslutning till rambeslutet och föreslog den ordalydelse som infördes i lagen. (Se prop. 2014/15:29 s. 177 f., 277 f. och 299.)\nNärmare om tillämpningen av undantagen\n12. Den svenska lagtexten är tydlig. För att undantagen om samtycke från den dömde och medgivande från den andra medlemsstaten ska vara tillämpliga krävs att den dömde kommer att utvisas till följd av ett i domen meddelat beslut. Att ”domen” syftar på den dom som ska sändas över till den andra medlemsstaten framgår av första stycket av respektive paragraf (se 2 kap. 2 § första stycket och 3 § första stycket).\n13. Det bör inte komma i fråga att till nackdel för den dömde tolka lagtextens undantag från kravet på hans eller hennes samtycke mot ordalydelsen. Att Kriminalvården kan ha fattat ett strafftidsbeslut som gäller flera domar saknar betydelse.\n14. Som framgått är lagtextens undantag för när den verkställande statens medgivande inte krävs utformat på samma sätt som när det gäller undantaget från den dömdes samtycke; utvisningsbeslutet ska vara meddelat i domen. Systemet med erkännande och verkställighet bygger på att medlemsstaterna agerar lojalt i förhållande till varandra (jfr t.ex. p. 5 i ingressen till rambeslutet). Av den svenska lagtexten framgår tydligt, i linje med denna lojalitetsprincip, att det ska göras en prövning av om förutsättningarna är uppfyllda för att tillämpa undantaget om att den andra statens medgivande inte krävs. Att det är fråga om kriterier som ska vara uppfyllda och som ska prövas av den utfärdande staten framgår även av rambeslutet (se artikel 4). Även i detta avseende ska lagtexten tillämpas enligt sin ordalydelse.\n15. Tilläggas kan att de aktuella undantagens genomförande i svensk rätt följer det svenska systemet att utvisning till följd av brott är en särskild rättsverkan av brott som ska beslutas av den domstol som handlägger brottmålet (se 8 a kap. 8 § utlänningslagen). Att rambeslutet ger utrymme för att medlemsstater kan ha andra system för hur utvisning till följd av brott regleras saknar betydelse för tillämpningen av den svenska lagstiftningen.\nSlutsats\n16. Slutsatsen är att om den dömde har utvisats ur Sverige endast genom ett beslut i en annan brottmålsdom än den som ska sändas över till en medlemsstat inom EU för att erkännas och verkställas där, krävs den dömdes samtycke och den verkställande statens medgivande. Undantagen från samtycke och medgivande förutsätter att beslutet om utvisning är meddelat i den dom som ska sändas över för erkännande och verkställighet.\nBedömningen i detta fall\n17. B.A.G. har inte utvisats ur Sverige genom ett beslut som meddelats i den dom som det överklagade beslutet om översändande gäller, dvs. Solna tingsrätts dom den 21 december 2023 (se p. 3). Undantagen från kraven på hans samtycke och medgivande från behörig myndighet i Spanien är därmed inte tillämpliga. Att Kriminalvården fattat ett strafftidsbeslut som omfattar flera domar saknar betydelse.\n18. Den i prövningstillståndet ställda frågan ska därför besvaras så att det krävs samtycke från B.A.G. och medgivande från den behöriga myndigheten i Spanien för att översända domen dit för erkännande och verkställighet.\n19. Vid denna utgång bör prövningstillstånd meddelas rörande målet i övrigt.\n20. Eftersom det saknas förutsättningar att sända över domen för erkännande och verkställighet ska hovrättens beslut ändras och Kriminalvårdens beslut upphävas.\nHD:s avgörande\nHD förklarar att det krävs samtycke från B.A.G. och medgivande från den behöriga myndigheten i Spanien för att översända Solna tingsrätts dom den 21 december 2023 i mål B 8637-23 till Spanien för erkännande och verkställighet där.\nHD meddelar prövningstillstånd rörande målet i övrigt, ändrar hovrättens beslut och upphäver Kriminalvårdens beslut den 24 januari 2024 – – – att översända domen, tillsammans med intyg, till Spanien för erkännande och verkställighet.\n\n [1] Rådets rambeslut 2008/909/RIF av den 27 november 2008 om tillämpning av principen om ömsesidigt erkännande på brottmålsdomar avseende fängelse eller andra frihetsberövande åtgärder i syfte att verkställa dessa inom Europeiska unionen.\n  - Visa mindre innehåll\nDom eller beslut\npicture_as_pdf\nÄ 3500-24.pdf\narrow_forward\nÖppnas i en ny flik\nKontakt\nFrågor och svar\nTillgänglighet\nPrenumerera på RSS-flöde"
}